<?php
echo '<h1>Выбор чисел принадлежащих интервалу(1,3):</h1><hr>';

$a = 1.5;
$b = 10.8;
$c = 2.5;

echo "<p>a = $a</p>";
echo "<p>b = $b</p>";
echo "<p>c = $c</p>";
echo '<hr>';

if ($a < 3 && $a > 1) {
    echo '<p class="blue"><b>a принадлежит иннтервалу (1,3)</b></p>';
} else
    echo '<p><b>a не принадлежит иннтервалу (1,3)</b></p>';

if ($b < 3 && $b > 1) {
    echo '<p class="blue"><b>b принадлежит иннтервалу (1,3)</b></p>';
} else
    echo '<p><b>b не принадлежит иннтервалу (1,3)</b></p>';

if ($c < 3 && $c > 1) {
    echo '<p class="blue"><b>c принадлежит иннтервалу (1,3)</b></p>';
} else
    echo '<p><b>c не принадлежит иннтервалу (1,3)</b></p>';
?>